In [1]:
import pandas as pd

In [2]:
from pandas import Series, DataFrame

In [4]:
obj = pd.Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [5]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [6]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [8]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [9]:
obj2['d']

4

In [10]:
obj2[obj2>2]

d    4
b    7
c    3
dtype: int64

In [12]:
obj2*2

d     8
b    14
a   -10
c     6
dtype: int64

In [13]:
import numpy as np
np.exp(obj2)

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [14]:
'b' in obj2

True

In [15]:
4 in obj2

False

In [16]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [17]:
sdata = {'Ohio':35000, 'Texas':71000, 'Origon':16000, 'Utah':5000}
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Origon    16000
Utah       5000
dtype: int64

In [18]:
states = ['Califonia', 'Ohio', 'Origon', 'Texas']
obj4 = pd.Series(sdata, index=states)
obj4

Califonia        NaN
Ohio         35000.0
Origon       16000.0
Texas        71000.0
dtype: float64

In [22]:
# 누락된 데이터 찾을때 사용 
pd.isnull(obj4)
pd.notnull(obj4)
obj4.isnull()

Califonia     True
Ohio         False
Origon       False
Texas        False
dtype: bool

In [23]:
obj3 + obj4

Califonia         NaN
Ohio          70000.0
Origon        32000.0
Texas        142000.0
Utah              NaN
dtype: float64

In [25]:
obj4 + obj3

Califonia         NaN
Ohio          70000.0
Origon        32000.0
Texas        142000.0
Utah              NaN
dtype: float64

In [26]:
obj4.name = 'population'

In [27]:
obj4.index.name ='state'

In [28]:
obj4

state
Califonia        NaN
Ohio         35000.0
Origon       16000.0
Texas        71000.0
Name: population, dtype: float64

In [29]:
data = {'state':['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
       'year':[2000, 2001, 2002, 2001, 2002, 2003],
       'pop':[1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)

In [30]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [31]:
frame.head() # 처음 5개

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [33]:
pd.DataFrame(data, columns=['year',  'pop', 'state']) # 순서변경!!

   year  pop   state
0  2000  1.5    Ohio
1  2001  1.7    Ohio
2  2002  3.6    Ohio
3  2001  2.4  Nevada
4  2002  2.9  Nevada
5  2003  3.2  Nevada

In [34]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'])

In [35]:
frame2

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [36]:
frame2.year

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [39]:
frame2.loc[3]

year       2001
state    Nevada
pop         2.4
debt        NaN
Name: 3, dtype: object

In [40]:
frame2.name = "State Info"

In [41]:
frame2

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [43]:
frame2['debt'] = np.arange(6.)

In [44]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   0.0
1  2001    Ohio  1.7   1.0
2  2002    Ohio  3.6   2.0
3  2001  Nevada  2.4   3.0
4  2002  Nevada  2.9   4.0
5  2003  Nevada  3.2   5.0

In [45]:
frame2['estern'] = frame2.state == 'Ohio'

In [46]:
frame2

   year   state  pop  debt  estern
0  2000    Ohio  1.5   0.0    True
1  2001    Ohio  1.7   1.0    True
2  2002    Ohio  3.6   2.0    True
3  2001  Nevada  2.4   3.0   False
4  2002  Nevada  2.9   4.0   False
5  2003  Nevada  3.2   5.0   False

In [47]:
del frame2['estern']

In [48]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   0.0
1  2001    Ohio  1.7   1.0
2  2002    Ohio  3.6   2.0
3  2001  Nevada  2.4   3.0
4  2002  Nevada  2.9   4.0
5  2003  Nevada  3.2   5.0

In [49]:
obj = pd.Series(range(3), index=['a', 'b', 'c'])
index = obj.index

In [50]:
index

Index(['a', 'b', 'c'], dtype='object')

In [53]:
labels = pd.Index(np.arange(3))
labels

Int64Index([0, 1, 2], dtype='int64')

In [54]:
obj2 = pd.Series([1.5, -2.5, 0], index =labels)

In [55]:
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64